<a href="https://colab.research.google.com/github/Supersplicer98/Sales-Predictions/blob/main/Titanic_Core_Exercise_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd

In [30]:
df = pd.read_csv('/content/titanic (3).csv')
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [8]:
df.loc[:, ['Survived']].value_counts()

Survived
0           549
1           342
dtype: int64

In [9]:
df.loc[:, ['Survived']].mean()

Survived    0.383838
dtype: float64

In [55]:
survived_filter = df[ 'Survived' ] == 1

In [56]:
df.loc[survived_filter, :].head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [57]:
df.loc[survived_filter, 'Sex'].value_counts(dropna = False)

female    233
male      109
Name: Sex, dtype: int64

In [58]:
fareFilter = df.loc[:, 'Fare'] < 10

In [60]:
df.loc[survived_filter & fareFilter].head()

    PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
2             3         1       3  ...  7.9250   NaN         S
19           20         1       3  ...  7.2250   NaN         C
22           23         1       3  ...  8.0292   NaN         Q
28           29         1       3  ...  7.8792   NaN         Q
32           33         1       3  ...  7.7500   NaN         Q

[5 rows x 12 columns]

In [61]:
len(df.loc[survived_filter & fare_filter, :]) / len(df.loc[survived_filter, :])

0.195906432748538

In [65]:
df.loc[~survived_filter, 'Age', ].mean()

30.62617924528302

In [63]:
df.loc[survived_filter, 'Age'].mean()

28.343689655172415

In [64]:
df.groupby(['Sex', 'Survived'])[['Age']].mean()

                       Age
Sex    Survived
female 0         25.046875
       1         28.847716
male   0         31.618056
       1         27.276022